; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	spectrograph0 - mode
	image3 - mode
	spectrograph4 - mode
	image1 - mode
	infrared2 - mode
	Star1 - direction
	GroundStation3 - direction
	Star2 - direction
	Star4 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
)
(:goal (and
	(pointing satellite2 Phenomenon6)
	(have_image Phenomenon5 infrared2)
	(have_image Phenomenon6 image3)
	(have_image Star7 spectrograph4)
))

)

; plan
1. (turn_to satellite1 star2 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star2)
   goals met: 0 of 4
2. (turn_to satellite0 groundstation0 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 4
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 4
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
5. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 4
6. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 4
7. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 4
8. (turn_to satellite0 phenomenon6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 4
9. (take_image satellite0 phenomenon6 instrument0 image3)
   added: (have_image phenomenon6 image3)
   goals met: 1 of 4
10. (turn_to satellite1 star7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star7)
   goals met: 1 of 4
11. (take_image satellite1 star7 instrument1 spectrograph4)
   added: (have_image star7 spectrograph4)
   goals met: 2 of 4
12. (turn_to satellite2 groundstation0 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation0)
   goals met: 2 of 4
13. (calibrate satellite2 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 2 of 4
14. (turn_to satellite2 phenomenon5 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon5)
   goals met: 2 of 4
15. (take_image satellite2 phenomenon5 instrument3 infrared2)
   added: (have_image phenomenon5 infrared2)
   goals met: 3 of 4
16. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   goals met: 4 of 4
